RFThings/RF210-ESP32-Arduino-BSP/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB Serial COM Port
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

rf210.name=RF210

rf210.bootloader.tool=esptool_py
rf210.bootloader.tool.default=esptool_py

rf210.upload.tool=esptool_py
rf210.upload.tool.default=esptool_py
rf210.upload.tool.network=esp_ota

rf210.upload.maximum_size=1310720
rf210.upload.maximum_data_size=327680
rf210.upload.flags=
rf210.upload.extra_flags=
rf210.upload.use_1200bps_touch=false
rf210.upload.wait_for_upload_port=false

rf210.serial.disableDTR=false
rf210.serial.disableRTS=false

rf210.build.tarch=riscv32
rf210.build.target=esp
rf210.build.mcu=esp32c3
rf210.build.core=esp32
rf210.build.variant=esp32c3
rf210.build.board=ESP32C3_DEV
rf210.build.bootloader_addr=0x0

rf210.build.cdc_on_boot=0
rf210.build.f_cpu=160000000L
rf210.build.flash_size=4MB
rf210.build.flash_freq=80m
rf210.build.flash_mode=qio
rf210.build.boot=qio
rf210.build.partitions=default
rf210.build.defines=

rf210.build.copy_jtag_files=0
rf210.build.code_debug=0
rf210.upload.speed=115200
rf210.upload.erase_cmd=-e

rf210.menu.CDCOnBoot.cdc=Enabled
rf210.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
rf210.menu.CDCOnBoot.default=Disabled
rf210.menu.CDCOnBoot.default.build.cdc_on_boot=0

##############################################################

rf210_advance.name=RF210 (Advanced)

rf210_advance.bootloader.tool=esptool_py
rf210_advance.bootloader.tool.default=esptool_py

rf210_advance.upload.tool=esptool_py
rf210_advance.upload.tool.default=esptool_py
rf210_advance.upload.tool.network=esp_ota

rf210_advance.upload.maximum_size=1310720
rf210_advance.upload.maximum_data_size=327680
rf210_advance.upload.flags=
rf210_advance.upload.extra_flags=
rf210_advance.upload.use_1200bps_touch=false
rf210_advance.upload.wait_for_upload_port=false

rf210_advance.serial.disableDTR=false
rf210_advance.serial.disableRTS=false

rf210_advance.build.tarch=riscv32
rf210_advance.build.target=esp
rf210_advance.build.mcu=esp32c3
rf210_advance.build.core=esp32
rf210_advance.build.variant=esp32c3
rf210_advance.build.board=ESP32C3_DEV
rf210_advance.build.bootloader_addr=0x0

rf210_advance.build.cdc_on_boot=0
rf210_advance.build.f_cpu=160000000L
rf210_advance.build.flash_size=4MB
rf210_advance.build.flash_freq=80m
rf210_advance.build.flash_mode=qio
rf210_advance.build.boot=qio
rf210_advance.build.partitions=default
rf210_advance.build.defines=

## IDE 2.0 Seems to not update the value
rf210_advance.menu.JTAGAdapter.default=Disabled
rf210_advance.menu.JTAGAdapter.default.build.copy_jtag_files=0
rf210_advance.menu.JTAGAdapter.builtin=Integrated USB JTAG
rf210_advance.menu.JTAGAdapter.builtin.build.openocdscript=esp32c3-builtin.cfg
rf210_advance.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
rf210_advance.menu.JTAGAdapter.external=FTDI Adapter
rf210_advance.menu.JTAGAdapter.external.build.openocdscript=esp32c3-ftdi.cfg
rf210_advance.menu.JTAGAdapter.external.build.copy_jtag_files=1
rf210_advance.menu.JTAGAdapter.bridge=ESP USB Bridge
rf210_advance.menu.JTAGAdapter.bridge.build.openocdscript=esp32c3-bridge.cfg
rf210_advance.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

rf210_advance.menu.CDCOnBoot.cdc=Enabled
rf210_advance.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
rf210_advance.menu.CDCOnBoot.default=Disabled
rf210_advance.menu.CDCOnBoot.default.build.cdc_on_boot=0

rf210_advance.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
rf210_advance.menu.PartitionScheme.default.build.partitions=default
rf210_advance.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
rf210_advance.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
rf210_advance.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
rf210_advance.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
rf210_advance.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
rf210_advance.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
rf210_advance.menu.PartitionScheme.minimal.build.partitions=minimal
rf210_advance.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
rf210_advance.menu.PartitionScheme.no_ota.build.partitions=no_ota
rf210_advance.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
rf210_advance.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
rf210_advance.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
rf210_advance.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
rf210_advance.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
rf210_advance.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
rf210_advance.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
rf210_advance.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
rf210_advance.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
rf210_advance.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
rf210_advance.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
rf210_advance.menu.PartitionScheme.huge_app.build.partitions=huge_app
rf210_advance.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
rf210_advance.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
rf210_advance.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
rf210_advance.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
rf210_advance.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
rf210_advance.menu.PartitionScheme.fatflash.build.partitions=ffat
rf210_advance.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
rf210_advance.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
rf210_advance.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
rf210_advance.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
rf210_advance.menu.PartitionScheme.rainmaker=RainMaker
rf210_advance.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
rf210_advance.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

rf210_advance.menu.CPUFreq.160=160MHz (WiFi)
rf210_advance.menu.CPUFreq.160.build.f_cpu=160000000L
rf210_advance.menu.CPUFreq.80=80MHz (WiFi)
rf210_advance.menu.CPUFreq.80.build.f_cpu=80000000L
rf210_advance.menu.CPUFreq.40=40MHz
rf210_advance.menu.CPUFreq.40.build.f_cpu=40000000L
rf210_advance.menu.CPUFreq.20=20MHz
rf210_advance.menu.CPUFreq.20.build.f_cpu=20000000L
rf210_advance.menu.CPUFreq.10=10MHz
rf210_advance.menu.CPUFreq.10.build.f_cpu=10000000L

rf210_advance.menu.FlashMode.qio=QIO
rf210_advance.menu.FlashMode.qio.build.flash_mode=dio
rf210_advance.menu.FlashMode.qio.build.boot=qio
rf210_advance.menu.FlashMode.dio=DIO
rf210_advance.menu.FlashMode.dio.build.flash_mode=dio
rf210_advance.menu.FlashMode.dio.build.boot=dio
rf210_advance.menu.FlashMode.qout=QOUT
rf210_advance.menu.FlashMode.qout.build.flash_mode=dout
rf210_advance.menu.FlashMode.qout.build.boot=qout
rf210_advance.menu.FlashMode.dout=DOUT
rf210_advance.menu.FlashMode.dout.build.flash_mode=dout
rf210_advance.menu.FlashMode.dout.build.boot=dout

rf210_advance.menu.FlashFreq.80=80MHz
rf210_advance.menu.FlashFreq.80.build.flash_freq=80m
rf210_advance.menu.FlashFreq.40=40MHz
rf210_advance.menu.FlashFreq.40.build.flash_freq=40m

rf210_advance.menu.FlashSize.4M=4MB (32Mb)
rf210_advance.menu.FlashSize.4M.build.flash_size=4MB
rf210_advance.menu.FlashSize.8M=8MB (64Mb)
rf210_advance.menu.FlashSize.8M.build.flash_size=8MB
rf210_advance.menu.FlashSize.8M.build.partitions=default_8MB
rf210_advance.menu.FlashSize.2M=2MB (16Mb)
rf210_advance.menu.FlashSize.2M.build.flash_size=2MB
rf210_advance.menu.FlashSize.2M.build.partitions=minimal
rf210_advance.menu.FlashSize.16M=16MB (128Mb)
rf210_advance.menu.FlashSize.16M.build.flash_size=16MB

rf210_advance.menu.UploadSpeed.921600=921600
rf210_advance.menu.UploadSpeed.921600.upload.speed=921600
rf210_advance.menu.UploadSpeed.115200=115200
rf210_advance.menu.UploadSpeed.115200.upload.speed=115200
rf210_advance.menu.UploadSpeed.256000.windows=256000
rf210_advance.menu.UploadSpeed.256000.upload.speed=256000
rf210_advance.menu.UploadSpeed.230400.windows.upload.speed=256000
rf210_advance.menu.UploadSpeed.230400=230400
rf210_advance.menu.UploadSpeed.230400.upload.speed=230400
rf210_advance.menu.UploadSpeed.460800.linux=460800
rf210_advance.menu.UploadSpeed.460800.macosx=460800
rf210_advance.menu.UploadSpeed.460800.upload.speed=460800
rf210_advance.menu.UploadSpeed.512000.windows=512000
rf210_advance.menu.UploadSpeed.512000.upload.speed=512000

rf210_advance.menu.DebugLevel.none=None
rf210_advance.menu.DebugLevel.none.build.code_debug=0
rf210_advance.menu.DebugLevel.error=Error
rf210_advance.menu.DebugLevel.error.build.code_debug=1
rf210_advance.menu.DebugLevel.warn=Warn
rf210_advance.menu.DebugLevel.warn.build.code_debug=2
rf210_advance.menu.DebugLevel.info=Info
rf210_advance.menu.DebugLevel.info.build.code_debug=3
rf210_advance.menu.DebugLevel.debug=Debug
rf210_advance.menu.DebugLevel.debug.build.code_debug=4
rf210_advance.menu.DebugLevel.verbose=Verbose
rf210_advance.menu.DebugLevel.verbose.build.code_debug=5

rf210_advance.menu.EraseFlash.none=Disabled
rf210_advance.menu.EraseFlash.none.upload.erase_cmd=
rf210_advance.menu.EraseFlash.all=Enabled
rf210_advance.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
